RIET/src/Catalogs/BORGs/BORGs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BORGs</name>
  <attributes>
    <name>Компания</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Segment</name>
    <type>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultAU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>DefaultWH</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>OracleERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>TechnicalDescriptionContacts</name>
    <attributes>
      <name>Contact</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/InformationRegisters/AUsAndBORGs/AUsAndBORGs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AUsAndBORGs</name>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BORG</name>
    <type>
      <types>CatalogRef.BORGs</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/TDStatuses/TDStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TDStatuses</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.TDStatuses</types>
    </type>
  </resources>
  <attributes>
    <name>Query</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMail</name>
    <type>
      <types>DocumentRef.EMails</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>PartNo</name>
    <type>
      <types>CatalogRef.Catalog</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DOC</name>
    <type>
      <types>DocumentRef.КонсолидированныйПакетЗаявокНаПеревозку</types>
      <types>DocumentRef.ExportRequest</types>
      <types>CatalogRef.BORGs</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Enums/TDStatuses/TDStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TDStatuses</name>
  <enumValues>
    <name>NotRequired</name>
  </enumValues>
  <enumValues>
    <name>Requested</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Received</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/Trip/Trip.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Trip</name>
  <registerRecords>AccumulationRegister.LocalDistributionCostsMilageWeightVolume</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerItem</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionCostsPerKG</registerRecords>
  <registerRecords>AccumulationRegister.LocalDistributionAccessorialCostsPerItem</registerRecords>
  <attributes>
    <name>WarehouseFrom</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Draft</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Final</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Equipment</name>
    <type>
      <types>CatalogRef.Equipments</types>
    </type>
  </attributes>
  <attributes>
    <name>EquipmentNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ETD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ATD</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossWeightKG</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CubicMeters</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseToList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysETAWithoutATA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DomesticOBSentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Specialist</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroBaseCostsSum</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BaseCostsSumSLBUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAccessorialCostsSumUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TypeOfTransport</name>
    <type>
      <types>EnumRef.TypesOfTransport</types>
    </type>
  </attributes>
  <attributes>
    <name>Transport</name>
    <type>
      <types>CatalogRef.Transport</types>
    </type>
  </attributes>
  <attributes>
    <name>DontSendInTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>FinalDestinations</name>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>Waybill</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ETA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ATA</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Mileage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DomesticOB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>WarehouseTo</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Urgency</name>
      <type>
        <types>EnumRef.Urgencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Gold</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalEntity</name>
      <type>
        <types>CatalogRef.LegalEntities</types>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Costs</name>
    <attributes>
      <name>CostType</name>
      <type>
        <types>CatalogRef.AccessorialCosts</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Catalogs/Warehouses/Warehouses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Warehouses</name>
  <predefined>
    <items>
      <name>Other</name>
      <description>NOT IN LIST (MANUAL INPUT)</description>
    </items>
    <items>
      <name>UNKN</name>
      <description>UNKNOWN</description>
    </items>
  </predefined>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CountryCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RCACountry</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>City</name>
    <type>
      <types>CatalogRef.Cities</types>
    </type>
  </attributes>
  <attributes>
    <name>Address1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Address3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContactName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContactPhone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContactEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Port</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AddressRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Latitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Longitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegionProvince</name>
    <type>
      <types>CatalogRef.RegionProvince</types>
    </type>
  </attributes>
  <attributes>
    <name>FacilityType</name>
    <type>
      <types>CatalogRef.FacilityTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Roles</name>
    <attributes>
      <name>Role</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/BORGs/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьДополнительныеДанныеВДополнительныеСвойстваПередЗаписью();
	
	ПроверитьЗаполнениеРеквизитов(
		Отказ,
		ДополнительныеСвойства.ВыборкаAUsAndBORGs);
		
		
	// { RGS ASeryakov, 07.12.2018 14:16:16 S-I-0006301
	ContactsTo = TechnicalDescriptionContacts.Выгрузить().ВыгрузитьКолонку("Contacts");
	ContactsAfter = ПолучитьContacts(Ссылка).ВыгрузитьКолонку("Contacts");

	Если НЕ ОбщегоНазначения.КоллекцииИдентичны(ContactsTo, ContactsAfter) И ContactsTo.Количество() > ContactsAfter.Количество() Тогда
		
		Recipient = ПолучитьМассивУдаленныхЭлементов(ContactsTo, ContactsAfter);
		
		УстановитьПривилегированныйРежим(Истина);
		
			ОбновитьTDStatusesDOCsAtDeleteRecipient(Отказ, Recipient);
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Если НЕ Отказ Тогда
			Сообщить("TD status was successfully updated.");
		КонецЕсли;
		
	КонецЕсли;
	

	// } RGS ASeryakov 07.12.2018 14:16:25 S-I-0006301

КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных(Отказ)
	
	Код = СокрЛП(Код);
	Наименование = СокрЛП(Наименование);
	
	// Для нового БОРГа автоматически пропишем связь этого борга и Default AU
	Если ЭтоНовый() И ЗначениеЗаполнено(DefaultAU) Тогда
		
		МенеджерЗаписи = РегистрыСведений.AUsAndBORGs.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.AU = DefaultAU;
		
		НоваяСсылка = Справочники.BORGs.ПолучитьСсылку();
		УстановитьСсылкуНового(НоваяСсылка);
		МенеджерЗаписи.BORG = НоваяСсылка;
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Failed to link current BORG with Default AU.
				|See errors above.
				|" + ОписаниеОшибки(),
				,,, Отказ);
		КонецПопытки;
		
	КонецЕсли;
	
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(TechnicalDescriptionContacts, "Contact");
	
КонецПроцедуры 

Процедура ПоместитьДополнительныеДанныеВДополнительныеСвойстваПередЗаписью()
	
	СтруктураПараметров = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	Если НЕ ПометкаУдаления Тогда
		     						
		Если ЗначениеЗаполнено(DefaultAU) Тогда
			    								
			Если ЗначениеЗаполнено(Ссылка) Тогда
				
				СтруктураПараметров.Вставить("AU", DefaultAU);
				СтруктураПараметров.Вставить("BORG", Ссылка);
				СтруктураТекстов.Вставить("AUsAndBORGs",
					"ВЫБРАТЬ
					|	AUsAndBORGs.AU
					|ИЗ
					|	РегистрСведений.AUsAndBORGs КАК AUsAndBORGs
					|ГДЕ
					|	AUsAndBORGs.AU = &AU
					|	И AUsAndBORGs.BORG = &BORG");
				
			КонецЕсли; 	
			
		КонецЕсли;
		
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
	ДополнительныеСвойства.Вставить("ВыборкаAUsAndBORGs", Неопределено);
	Если СтруктураРезультатов.Свойство("AUsAndBORGs") Тогда
		ДополнительныеСвойства.ВыборкаAUsAndBORGs = СтруктураРезультатов.AUsAndBORGs.Выбрать();
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверитьЗаполнениеРеквизитов(Отказ, ВыборкаAUsAndBORGs)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'No.' is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Name' is empty!",
			ЭтотОбъект, "Наименование", , Отказ);		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Компания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Company' is empty!",
			ЭтотОбъект, "Компания", , Отказ);
	КонецЕсли;
	
	// Segment
	Если НЕ ЗначениеЗаполнено(Segment) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Segment' is empty!",
			ЭтотОбъект, "Segment", , Отказ);
	Иначе
		
		Если ЗначениеЗаполнено(Segment.Родитель) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Select Segment, not Sub segment!",
				ЭтотОбъект, "Segment", , Отказ);
		КонецЕсли;
				
	КонецЕсли;
	
	// Default AU
	Если НЕ ЗначениеЗаполнено(DefaultAU) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Default AU' is empty!",
			ЭтотОбъект, "DefaultAU", , Отказ);

	Иначе
		
		Если ЗначениеЗаполнено(Ссылка)
			И ВыборкаAUsAndBORGs.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""You can not use ""AU " + СокрЛП(DefaultAU) + """ as default AU because it is not specified in the ""AUs and BORGs"" register for the ""BORG " + СокрЛП(ЭтотОбъект) + """!",
				ЭтотОбъект, "DefaultAU", , Отказ);
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Segment) И DefaultAU.Segment <> Segment Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Segment '" + СокрЛП(DefaultAU.Segment) + "' in AU differs from Segment in BORG!",
				ЭтотОбъект, "DefaultAU", , Отказ);
 		КонецЕсли;

	КонецЕсли;
	
	// Default WH
	Если ЗначениеЗаполнено(DefaultWH)
		И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(DefaultWH, "Warehouse")
		И DefaultWH <> Справочники.Warehouses.UNKN Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Default WH' is not a warehouse for Leg7!",
			ЭтотОбъект, "DefaultWH", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не ЗначениеЗаполнено(DefaultWH) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьParcelsWarehouseTo();
	
КонецПроцедуры

Процедура ОбновитьParcelsWarehouseTo()  
	
	//каждый раз при изменении default WH в борге, нужно делать обновление WH to для всех парселей, 
	//в которых указан WH from Major или НЕК и в деталях есть PO с этим боргом и парсель еще не в final trip.
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	МассивWHFrom = Новый Массив;
	МассивWHFrom.Добавить(Справочники.Warehouses.НайтиПоКоду("RUS_SPBM"));
	МассивWHFrom.Добавить(Справочники.Warehouses.НайтиПоКоду("RUS_MJRM"));
	
	Запрос.УстановитьПараметр("МассивWHFrom", МассивWHFrom);
	Запрос.УстановитьПараметр("BORG", Ссылка);

	//отбираем только те парсели, для которых определен один default WH из айтемов
	Запрос.Текст = "ВЫБРАТЬ
	               |	ParcelsДетали.Ссылка КАК Parcel,
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH) КАК NumDistinctWH
	               |ПОМЕСТИТЬ ВТ_NumWH
	               |ИЗ
	               |	Справочник.Parcels.Детали КАК ParcelsДетали
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ParcelsДетали.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Parcel
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ParcelsДетали.Ссылка КАК Parcel,
	               |	ЕСТЬNULL(ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH, ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)) КАК DefaultWH,
	               |	ParcelsДетали.Ссылка.WarehouseTo КАК WarehouseTo,
	               |	ЕСТЬNULL(ВТ_NumWH.NumDistinctWH, 0) КАК NumDistinctWH
	               |ИЗ
	               |	Справочник.Parcels.Детали КАК ParcelsДетали
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Trip.Parcels КАК TripParcels
	               |		ПО ParcelsДетали.Ссылка = TripParcels.Parcel
	               |			И (НЕ TripParcels.Ссылка.ПометкаУдаления)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_NumWH КАК ВТ_NumWH
	               |		ПО ParcelsДетали.Ссылка = ВТ_NumWH.Parcel
	               |ГДЕ
	               |	ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ = &BORG
	               |	И ParcelsДетали.Ссылка.ExportRequest = ЗНАЧЕНИЕ(Документ.ExportRequest.ПустаяСсылка)
	               |	И ParcelsДетали.Ссылка.WarehouseFrom В(&МассивWHFrom)
	               |	И ЕСТЬNULL(ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH, ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)
	               |	И ВЫБОР
	               |			КОГДА ЕСТЬNULL(ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH, ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Warehouses.UNKN)
	               |					И ParcelsДетали.Ссылка.WarehouseTo <> ParcelsДетали.Ссылка.WarehouseFrom
	               |				ТОГДА ИСТИНА
	               |			КОГДА ЕСТЬNULL(ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH, ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)) <> ParcelsДетали.Ссылка.WarehouseTo
	               |					И ЕСТЬNULL(ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH, ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Warehouses.UNKN)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И TripParcels.Ссылка ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ParcelsДетали.Ссылка,
	               |	ЕСТЬNULL(ParcelsДетали.СтрокаИнвойса.СтрокаЗаявкиНаЗакупку.Владелец.БОРГ.DefaultWH, ЗНАЧЕНИЕ(Справочник.Warehouses.ПустаяСсылка)),
	               |	ParcelsДетали.Ссылка.WarehouseTo,
	               |	ВТ_NumWH.NumDistinctWH";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ParcelОбъект = Выборка.Parcel.ПолучитьОбъект();
		Если Выборка.NumDistinctWH = 1 Тогда
			РГСофтКлиентСервер.УстановитьЗначение(ParcelОбъект.WarehouseTo, ?(Выборка.DefaultWH = Справочники.Warehouses.UNKN, ParcelОбъект.WarehouseFrom, Выборка.DefaultWH));
		Иначе
			РГСофтКлиентСервер.УстановитьЗначение(ParcelОбъект.WarehouseTo, ParcelОбъект.WarehouseFrom);
		КонецЕсли;
		
		ParcelОбъект.ОбменДанными.Загрузка = Истина;
		ParcelОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// { RGS ASeryakov, 07.12.2018 14:16:16 S-I-0006301
Функция ПолучитьContacts(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BORGsTechnicalDescriptionContacts.Contact
	|ИЗ
	|	Справочник.BORGs.TechnicalDescriptionContacts КАК BORGsTechnicalDescriptionContacts
	|ГДЕ
	|	BORGsTechnicalDescriptionContacts.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьМассивУдаленныхЭлементов(МассивИсходный, МассивИзмененный)
	
	МассивУдаленных = Новый Массив();
	ТаблицаУдаленных = МассивИсходный;
	
	Для каждого Строка Из МассивИсходный Цикл
	
		Если МассивИзмененный.Найти(Строка) = Неопределено Тогда
			
			МассивУдаленных.Добавить();
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат МассивУдаленных;
	
КонецФункции // ПулучитьТаблицуУдаленныхЭлементов()

Процедура ОбновитьTDStatusesDOCsAtDeleteRecipient(Отказ, Recipient)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	TDStatusesСрезПоследних.DOC КАК DOC,
	|	TDStatusesСрезПоследних.Query КАК Query,
	|	TDStatusesСрезПоследних.Item КАК Item,
	|	TDStatusesСрезПоследних.PartNo КАК PartNo
	|ИЗ
	|	РегистрСведений.TDStatuses.СрезПоследних(, EMail.Recipients.Recipient В (&Recipient)) КАК TDStatusesСрезПоследних
	|ГДЕ
	|	TDStatusesСрезПоследних.Status = ЗНАЧЕНИЕ(Перечисление.TDStatuses.Requested)";
	
	Запрос.УстановитьПараметр("Recipient", Recipient);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтрокаОшибок = "";
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.TDStatuses.СоздатьНаборЗаписей();
			НаборЗаписей.Записывать = Истина;
			НаборЗаписей.Отбор.DOC = Выборка.DOC;
			НаборЗаписей.Отбор.Query = Выборка.Query;
			НаборЗаписей.Отбор.Item = Выборка.Item;
			НаборЗаписей.Прочитать();
			
			НаборЗаписей.Период 		= ТекущаяДатаСеанса();
			НаборЗаписей.ModifiedBy 	= Пользователи.ТекущийПользователь();
			НаборЗаписей.DOC			= Выборка.DOC;
			НаборЗаписей.PartNo		= Выборка.PartNo;
			НаборЗаписей.Status		= Перечисления.TDStatuses.Submitted;
			НаборЗаписей.DOC 		= Выборка.DOC;
			НаборЗаписей.Query		= Выборка.Query;
			НаборЗаписей.Item		= Выборка.Item;
			НаборЗаписей.EMail		= Неопределено;
			
			НаборЗаписей.Записать(Ложь);
			
			ЗафиксироватьТранзакцию();
		Исключение
			
			Отказ = Истина;
			

			ОтменитьТранзакцию();
			
			DOC = ?(Выборка.DOC = Неопределено, "DOC не получен", Строка(Выборка.DOC));
			
			СтрокаОшибок = СтрокаОшибок + Символы.ПС + "Failed to update TD statuses in DOCs at delete Recipient in BORG: " + Выборка.DOC + " PartNo: " + СокрЛП(Выборка.PartNo) +";"+" Описание ошибки: " + ОписаниеОшибки();
			
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СтрокаОшибок) Тогда
	
		Сообщить("Failed to update TD statuses in DOCs at delete Recipient in BORG,
		|please send request via RIET-support." + Символы.ПС + СтрокаОшибок, СтатусСообщения.ОченьВажное);
	
	КонецЕсли;
	
КонецПроцедуры

// } RGS ASeryakov 07.12.2018 14:16:25 S-I-0006301
